Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_esmc.h
} ESMC_CommandTypeDef;


#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL ESMC Callback ID enumeration definition
  */
typedef enum
{
  HAL_ESMC_ERROR_CB_ID          = 0x00U,  /*!< ESMC Error Callback ID            */
  HAL_ESMC_ABORT_CB_ID          = 0x01U,  /*!< ESMC Abort Callback ID            */
  HAL_ESMC_CMD_CPLT_CB_ID       = 0x02U,  /*!< ESMC Command Complete Callback ID */
  HAL_ESMC_RX_CPLT_CB_ID        = 0x03U,  /*!< ESMC Rx Complete Callback ID      */
  HAL_ESMC_TX_CPLT_CB_ID        = 0x04U,  /*!< ESMC Tx Complete Callback ID      */
  HAL_ESMC_RX_HALFBLOCK_CPLT_CB_ID   = 0x05U,  /*!< ESMC Rx Half Block Complete Callback ID */
  HAL_ESMC_TX_HALFBLOCK_CPLT_CB_ID   = 0x06U,  /*!< ESMC Tx Half Block Complete Callback ID */
  HAL_ESMC_MSP_INIT_CB_ID       = 0x07U,  /*!< ESMC MspInit Callback ID          */
  HAL_ESMC_MSP_DEINIT_CB_ID     = 0x08U   /*!< ESMC MspDeInit Callback ID        */
} HAL_ESMC_CallbackIDTypeDef;

/**
  * @brief  HAL ESMC Callback pointer definition
  */
typedef void (*pESMC_CallbackTypeDef)(ESMC_HandleTypeDef *hesmc);
#endif
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ESMC_Exported_Constants ESMC Exported Constants
  * @{
  */

/** @defgroup ESMC_FIFO_SIZE ESMC FIFO SIZE
  * @{
  */
#define HAL_ESMC_TCR_MAX_LENGTH       0xFFFFFFFF
#define HAL_ESMC_FIFO_SIZE            0x10
/**
  * @}
  */
  
/** @defgroup ESMC_ErrorCode ESMC Error Code
  * @{
  */
#define HAL_ESMC_ERROR_NONE            ((uint32_t)0x00000000U) /*!< No error           */
#define HAL_ESMC_ERROR_TIMEOUT         ((uint32_t)0x00000001U) /*!< Timeout error      */
#define HAL_ESMC_ERROR_TRANSFER        ((uint32_t)0x00000002U) /*!< Transfer error     */
#define HAL_ESMC_ERROR_DMA             ((uint32_t)0x00000004U) /*!< DMA transfer error */
#define HAL_ESMC_ERROR_INVALID_PARAM   ((uint32_t)0x00000008U) /*!< Invalid parameters error */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
#define HAL_ESMC_ERROR_INVALID_CALLBACK 0x00000010U /*!< Invalid callback error   */
#endif
/**
  * @}
  */

/** @defgroup ESMC_CONTEXT ESMC CONTEXT
  * @{
  */
#define ESMC_CONTEXT_NONE                   ((uint32_t)0x00000000U)  /*!< None                             */
#define ESMC_CONTEXT_READ_FIXED_LENGTH      ((uint32_t)0x00000001U)  /*!< Read single block operation      */
#define ESMC_CONTEXT_READ_VARIABLE_LENGTH   ((uint32_t)0x00000002U)  /*!< Read multiple blocks operation   */
#define ESMC_CONTEXT_WRITE_FIXED_LENGTH     ((uint32_t)0x00000010U)  /*!< Write single block operation     */
#define ESMC_CONTEXT_WRITE_VARIABLE_LENGTH  ((uint32_t)0x00000020U)  /*!< Write multiple blocks operation  */
/**
  * @}
  */
  
/** @defgroup ESMC_DQSMode  ESMC DQS Mode
  * @{
  */
#define ESMC_DQS_DISABLE                    ((uint32_t)0x00000000U)         /*!< Disable DQS */
#define ESMC_DQS_ENABLE                     ((uint32_t)ESMC_CR3_XSPI_RWDS)  /*!< Enable DQS */
/**
  * @}
  */

/** @defgroup ESMC_ClockMode ESMC Clock Mode
  * @{
  */
#define ESMC_CLOCK_MODE_0                   ((uint32_t)0x00000000U)                     /*!<Clk stays low while nCS is released, the first data sampling is the first clock edge*/
#define ESMC_CLOCK_MODE_3                   ((uint32_t)(ESMC_CR2_CPOL | ESMC_CR2_CPHA)) /*!<Clk goes high while nCS is released, the first data sampling is the second clock edge*/
/**
  * @}
  */
  
/** @defgroup ESMC_ChipSelectHighTime ESMC ChipSelect High Time
  * @{
  */
#define ESMC_CS_HIGH_TIME_1_CYCLE    ((uint32_t)                                                       ESMC_TCR_HIGH_0)  /*!<nCS stay high for at least 1 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_2_CYCLE    ((uint32_t)                                     ESMC_TCR_HIGH_1                   ) /*!<nCS stay high for at least 2 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_3_CYCLE    ((uint32_t)(                                    ESMC_TCR_HIGH_1 | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 3 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_4_CYCLE    ((uint32_t)(                  ESMC_TCR_HIGH_2                                    )) /*!<nCS stay high for at least 4 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_5_CYCLE    ((uint32_t)(                  ESMC_TCR_HIGH_2                   | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 5 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_6_CYCLE    ((uint32_t)(                  ESMC_TCR_HIGH_2 | ESMC_TCR_HIGH_1                  )) /*!<nCS stay high for at least 6 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_7_CYCLE    ((uint32_t)(                  ESMC_TCR_HIGH_2 | ESMC_TCR_HIGH_1 | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 7 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_8_CYCLE    ((uint32_t)(ESMC_TCR_HIGH_3                                                      )) /*!<nCS stay high for at least 8 clock cycle between commands*/
#define ESMC_CS_HIGH_TIME_9_CYCLE    ((uint32_t)(ESMC_TCR_HIGH_3                                     | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 9 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_10_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3                   | ESMC_TCR_HIGH_1                  )) /*!<nCS stay high for at least 10 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_11_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3                   | ESMC_TCR_HIGH_1 | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 11 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_12_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3 | ESMC_TCR_HIGH_2                                    )) /*!<nCS stay high for at least 12 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_13_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3 | ESMC_TCR_HIGH_2                   | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 13 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_14_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3 | ESMC_TCR_HIGH_2 | ESMC_TCR_HIGH_1                  )) /*!<nCS stay high for at least 14 clock cycles between commands*/
#define ESMC_CS_HIGH_TIME_15_CYCLE   ((uint32_t)(ESMC_TCR_HIGH_3 | ESMC_TCR_HIGH_2 | ESMC_TCR_HIGH_1 | ESMC_TCR_HIGH_0)) /*!<nCS stay high for at least 15 clock cycles between commands*/
/**
  * @}
  */
  
/** @defgroup ESMC_ChipSelectHoldTime ESMC ChipSelect Hold Time
  * @{
  */
#define ESMC_CS_HOLD_TIME_2_CYCLE    ((uint32_t)                                                       ESMC_TCR_HOLD_0)  /*!<nCS stay hold for at least 2 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_3_CYCLE    ((uint32_t)                                     ESMC_TCR_HOLD_1                   ) /*!<nCS stay hold for at least 3 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_4_CYCLE    ((uint32_t)(                                    ESMC_TCR_HOLD_1 | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 4 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_5_CYCLE    ((uint32_t)(                  ESMC_TCR_HOLD_2                                    )) /*!<nCS stay hold for at least 5 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_6_CYCLE    ((uint32_t)(                  ESMC_TCR_HOLD_2                   | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 6 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_7_CYCLE    ((uint32_t)(                  ESMC_TCR_HOLD_2 | ESMC_TCR_HOLD_1                  )) /*!<nCS stay hold for at least 7 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_8_CYCLE    ((uint32_t)(                  ESMC_TCR_HOLD_2 | ESMC_TCR_HOLD_1 | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 8 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_9_CYCLE    ((uint32_t)(ESMC_TCR_HOLD_3                                                      )) /*!<nCS stay hold for at least 9 clock cycle between commands*/
#define ESMC_CS_HOLD_TIME_10_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3                                     | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 10 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_11_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3                   | ESMC_TCR_HOLD_1                  )) /*!<nCS stay hold for at least 11 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_12_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3                   | ESMC_TCR_HOLD_1 | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 12 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_13_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3 | ESMC_TCR_HOLD_2                                    )) /*!<nCS stay hold for at least 13 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_14_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3 | ESMC_TCR_HOLD_2                   | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 14 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_15_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3 | ESMC_TCR_HOLD_2 | ESMC_TCR_HOLD_1                  )) /*!<nCS stay hold for at least 15 clock cycles between commands*/
#define ESMC_CS_HOLD_TIME_16_CYCLE   ((uint32_t)(ESMC_TCR_HOLD_3 | ESMC_TCR_HOLD_2 | ESMC_TCR_HOLD_1 | ESMC_TCR_HOLD_0)) /*!<nCS stay hold for at least 16 clock cycles between commands*/
/**
  * @}
  */

/** @defgroup ESMC_SampleShifting ESMC Sample Shifting
  * @{
  */
#define ESMC_SAMPLE_SHIFTING_NONE         (0x00000000U)                                                                                                           /*!<Sample Shifting none */
#define ESMC_SAMPLE_SHIFTING_1_CYCLE      ((uint32_t)(                                                                                          ESMC_STRR_SMP_0)) /*!<Sample Shifting 1 cycle*/
#define ESMC_SAMPLE_SHIFTING_2_CYCLE      ((uint32_t)(                                                                        ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 2 cycle*/
#define ESMC_SAMPLE_SHIFTING_3_CYCLE      ((uint32_t)(                                                                        ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 3 cycle*/
#define ESMC_SAMPLE_SHIFTING_4_CYCLE      ((uint32_t)(                                                      ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 4 cycle*/
#define ESMC_SAMPLE_SHIFTING_5_CYCLE      ((uint32_t)(                                                      ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 5 cycle*/
#define ESMC_SAMPLE_SHIFTING_6_CYCLE      ((uint32_t)(                                                      ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 6 cycle*/
#define ESMC_SAMPLE_SHIFTING_7_CYCLE      ((uint32_t)(                                                      ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 7 cycle*/
#define ESMC_SAMPLE_SHIFTING_8_CYCLE      ((uint32_t)(                                    ESMC_STRR_SMP_3                                                      )) /*!<Sample Shifting 8 cycle*/
#define ESMC_SAMPLE_SHIFTING_9_CYCLE      ((uint32_t)(                                    ESMC_STRR_SMP_3                                     | ESMC_STRR_SMP_0)) /*!<Sample Shifting 9 cycle*/
#define ESMC_SAMPLE_SHIFTING_10_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 10 cycle*/
#define ESMC_SAMPLE_SHIFTING_11_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 11 cycle*/
#define ESMC_SAMPLE_SHIFTING_12_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 12 cycle*/
#define ESMC_SAMPLE_SHIFTING_13_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 13 cycle*/
#define ESMC_SAMPLE_SHIFTING_14_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 14 cycle*/
#define ESMC_SAMPLE_SHIFTING_15_CYCLE     ((uint32_t)(                                    ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 15 cycle*/
#define ESMC_SAMPLE_SHIFTING_16_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                                                                        )) /*!<Sample Shifting 16 cycle*/
#define ESMC_SAMPLE_SHIFTING_17_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                                                       | ESMC_STRR_SMP_0)) /*!<Sample Shifting 17 cycle*/
#define ESMC_SAMPLE_SHIFTING_18_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                                     | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 18 cycle*/
#define ESMC_SAMPLE_SHIFTING_19_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                                     | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 19 cycle*/
#define ESMC_SAMPLE_SHIFTING_20_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 20 cycle*/
#define ESMC_SAMPLE_SHIFTING_21_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 21 cycle*/
#define ESMC_SAMPLE_SHIFTING_22_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 22 cycle*/
#define ESMC_SAMPLE_SHIFTING_23_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 23 cycle*/
#define ESMC_SAMPLE_SHIFTING_24_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                                                      )) /*!<Sample Shifting 24 cycle*/
#define ESMC_SAMPLE_SHIFTING_25_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                                     | ESMC_STRR_SMP_0)) /*!<Sample Shifting 25 cycle*/
#define ESMC_SAMPLE_SHIFTING_26_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 26 cycle*/
#define ESMC_SAMPLE_SHIFTING_27_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 27 cycle*/
#define ESMC_SAMPLE_SHIFTING_28_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 28 cycle*/
#define ESMC_SAMPLE_SHIFTING_29_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 29 cycle*/
#define ESMC_SAMPLE_SHIFTING_30_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 30 cycle*/
#define ESMC_SAMPLE_SHIFTING_31_CYCLE     ((uint32_t)(                  ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 31 cycle*/
#define ESMC_SAMPLE_SHIFTING_32_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                                                                          )) /*!<Sample Shifting 32 cycle*/
#define ESMC_SAMPLE_SHIFTING_33_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                                                         | ESMC_STRR_SMP_0)) /*!<Sample Shifting 33 cycle*/
#define ESMC_SAMPLE_SHIFTING_34_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                                       | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 34 cycle*/
#define ESMC_SAMPLE_SHIFTING_35_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                                       | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 35 cycle*/
#define ESMC_SAMPLE_SHIFTING_36_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                     | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 36 cycle*/
#define ESMC_SAMPLE_SHIFTING_37_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                     | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 37 cycle*/
#define ESMC_SAMPLE_SHIFTING_38_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                     | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 38 cycle*/
#define ESMC_SAMPLE_SHIFTING_39_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                                     | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 39 cycle*/
#define ESMC_SAMPLE_SHIFTING_40_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3                                                      )) /*!<Sample Shifting 40 cycle*/
#define ESMC_SAMPLE_SHIFTING_41_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3                                     | ESMC_STRR_SMP_0)) /*!<Sample Shifting 41 cycle*/
#define ESMC_SAMPLE_SHIFTING_42_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 42 cycle*/
#define ESMC_SAMPLE_SHIFTING_43_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 43 cycle*/
#define ESMC_SAMPLE_SHIFTING_44_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 44 cycle*/
#define ESMC_SAMPLE_SHIFTING_45_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 45 cycle*/
#define ESMC_SAMPLE_SHIFTING_46_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 46 cycle*/
#define ESMC_SAMPLE_SHIFTING_47_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5                   | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 47 cycle*/
#define ESMC_SAMPLE_SHIFTING_48_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                                                                        )) /*!<Sample Shifting 48 cycle*/
#define ESMC_SAMPLE_SHIFTING_49_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                                                       | ESMC_STRR_SMP_0)) /*!<Sample Shifting 49 cycle*/
#define ESMC_SAMPLE_SHIFTING_50_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                                     | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 50 cycle*/
#define ESMC_SAMPLE_SHIFTING_51_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                                     | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 51 cycle*/
#define ESMC_SAMPLE_SHIFTING_52_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 52 cycle*/
#define ESMC_SAMPLE_SHIFTING_53_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 53 cycle*/
#define ESMC_SAMPLE_SHIFTING_54_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 54 cycle*/
#define ESMC_SAMPLE_SHIFTING_55_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4                   | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 55 cycle*/
#define ESMC_SAMPLE_SHIFTING_56_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                                                      )) /*!<Sample Shifting 56 cycle*/
#define ESMC_SAMPLE_SHIFTING_57_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                                     | ESMC_STRR_SMP_0)) /*!<Sample Shifting 57 cycle*/
#define ESMC_SAMPLE_SHIFTING_58_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 58 cycle*/
#define ESMC_SAMPLE_SHIFTING_59_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3                   | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 59 cycle*/
#define ESMC_SAMPLE_SHIFTING_60_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                                    )) /*!<Sample Shifting 60 cycle*/
#define ESMC_SAMPLE_SHIFTING_61_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2                   | ESMC_STRR_SMP_0)) /*!<Sample Shifting 61 cycle*/
#define ESMC_SAMPLE_SHIFTING_62_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1                  )) /*!<Sample Shifting 62 cycle*/
#define ESMC_SAMPLE_SHIFTING_63_CYCLE     ((uint32_t)(ESMC_STRR_SMP_5 | ESMC_STRR_SMP_4 | ESMC_STRR_SMP_3 | ESMC_STRR_SMP_2 | ESMC_STRR_SMP_1 | ESMC_STRR_SMP_0)) /*!<Sample Shifting 63 cycle*/
/**
  * @}
  */
  
/** @defgroup ESMC_TransferFormat ESMC Transfer Format
  * @{
  */
#define ESMC_TRANSFER_FORMAT_SINGLE         ((uint32_t)0x00000000U)                                    /*!<Transfer on a single line*/
#define ESMC_TRANSFER_FORMAT_DUAL           ((uint32_t)(ESMC_SOCR_SPIMODE_0))                          /*!<Transfer on two lines*/
#define ESMC_TRANSFER_FORMAT_QUAD           ((uint32_t)(ESMC_SOCR_SPIMODE_1))                          /*!<Transfer on four lines*/
#define ESMC_TRANSFER_FORMAT_OCTAL          ((uint32_t)(ESMC_SOCR_SPIMODE_0 | ESMC_SOCR_SPIMODE_1))    /*!<Transfer on eight lines*/
/**
  * @}
  */

