Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_esmc.h
/** @defgroup ESMC_InstructionMode ESMC Instruction Mode
* @{
*/
#define ESMC_INSTRUCTION_NONE          ((uint32_t)0x00U)    /*!<No instruction*/
#define ESMC_INSTRUCTION_SINGLE_LINE   ((uint32_t)0x01U)    /*!<Instruction on a single line*/
#define ESMC_INSTRUCTION_MULTI_LINES   ((uint32_t)0x02U)    /*!<Instruction on multi lines*/
/**
  * @}
  */

/** @defgroup ESMC_InstructionLength ESMC Instruction Length
* @{
*/
#define ESMC_INSTRCUTION_LEN_1_BYTE    ((uint32_t)0x00U)    /*!<Instruction 1 byte*/
#define ESMC_INSTRCUTION_LEN_2_BYTE    ((uint32_t)0x01U)    /*!<Instruction 2 bytes*/
/**
  * @}
  */

/** @defgroup ESMC_AddressMode ESMC Address Mode
* @{
*/
#define ESMC_ADDRESS_NONE              ((uint32_t)0x00U)    /*!<No address*/
#define ESMC_ADDRESS_SINGLE_LINE       ((uint32_t)0x01U)    /*!<Address on a single line*/
#define ESMC_ADDRESS_MULTI_LINES       ((uint32_t)0x02U)    /*!<Address on multi lines*/
/**
  * @}
  */

/** @defgroup ESMC_AddressSize ESMC Address Size
  * @{
  */
#define ESMC_ADDRESS_8_BITS            ((uint32_t)ESMC_CR3_ADDR8BIT)    /*!<8-bit address*/
#define ESMC_ADDRESS_16_BITS           ((uint32_t)ESMC_CR3_ADDR16BIT)   /*!<16-bit address*/
#define ESMC_ADDRESS_24_BITS           ((uint32_t)0x00)                 /*!<24-bit address*/
#define ESMC_ADDRESS_32_BITS           ((uint32_t)ESMC_CR3_ADDR32BIT)   /*!<32-bit address*/
/**
  * @}
  */

/** @defgroup ESMC_DataMode ESMC data mode
  * @{
  */
#define ESMC_DATA_NONE                 ((uint32_t)0x00U)   /*!<No data*/
#define ESMC_DATA_WRITE                ((uint32_t)0x01U)   /*!<data write mode*/
#define ESMC_DATA_READ                 ((uint32_t)0x02U)   /*!<data read mode*/
/**
  * @}
  */

/** @defgroup ESMC_AlternateBytesMode ESMC Alternate Bytes Mode
* @{
*/
#define ESMC_ALTERNATE_BYTES_DISABLE   0x00000000U                      /*!<No send alternate bytes*/
#define ESMC_ALTERNATE_BYTES_ENABLE    ((uint32_t)ESMC_SOCR_SENM)       /*!<Send alternate bytes after ADDR*/
/**
  * @}
  */

/** @defgroup ESMC_DualFlash_Mode  ESMC Dual Flash Mode
* @{
*/
#define ESMC_DUALFLASH_ENABLE         ((uint32_t)ESMC_CR_2QSPI)
#define ESMC_DUALFLASH_DISABLE        ((uint32_t)0x00000000U)
/**
  * @}
  */

/** @defgroup ESMC_XSPI_DualLatency  ESMC XSPI DualLatency
* @{
*/
#define ESMC_XSPI_DUALLATENCY_DISABLE       ((uint32_t)0x00000000)
#define ESMC_XSPI_DUALLATENCY_ENABLE        ((uint32_t)0x00000001)
/**
  * @}
  */

/** @defgroup ESMC_CS_PIN_SEL  ESMC CS pin select
* @{
*/
#define ESMC_SELECT_PIN_CS0         ((uint32_t)0x00000001U)      /*!<CS0 select*/
#define ESMC_SELECT_PIN_CS1         ((uint32_t)0x00000002U)      /*!<CS1 select*/
#define ESMC_SELECT_PIN_CS2         ((uint32_t)0x00000004U)      /*!<CS2 select*/
#define ESMC_SELECT_PIN_CS3         ((uint32_t)0x00000008U)      /*!<CS3 select*/
#define ESMC_SELECT_PIN_CS4         ((uint32_t)0x00000010U)      /*!<CS4 select*/
#define ESMC_SELECT_PIN_CS5         ((uint32_t)0x00000020U)      /*!<CS5 select*/
/**
  * @}
  */

/** @defgroup ESMC_DdrMode ESMC Ddr Mode
  * @{
  */
#define ESMC_DDR_DISABLE              ((uint32_t)0x00000000U)                                      /*!<Double data rate mode disabled */
#define ESMC_DDR_DATA                 ((uint32_t)(ESMC_SOCR_DDRDATA))                                          /*!<Double data rate mode enabled on data*/
#define ESMC_DDR_ADDR_DATA            ((uint32_t)(ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRDATA))                      /*!<Double data rate mode enabled on address and data */
#define ESMC_DDR_CMD_ADDR_DATA        ((uint32_t)(ESMC_SOCR_DDRCMD  | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRDATA))  /*!<Double data rate mode enabled on command and address and data */
/**
  * @}
  */

/** @defgroup ESMC_Flags ESMC Flags
  * @{
  */
#define ESMC_FLAG_SSACTIVE             (0xf0000000 | ESMC_SR_SSACTIVE)     /*!<SS outputs Active flag: any of the SS outputs is active (low)*/
#define ESMC_FLAG_RXBUSY               (0xf0000000 | ESMC_SR_RXBUSY)       /*!<RX In progress flag: ESMC is busy with the data reception from Flash*/
#define ESMC_FLAG_TXBUSY               (0xf0000000 | ESMC_SR_TXBUSY)       /*!<TX In progress flag: ESMC is busy with memory write operations*/
#define ESMC_FLAG_XIPBUSY              (0xf0000000 | ESMC_SR_XIPBUSY)      /*!<ESMC is busy in XIP state*/
#define ESMC_FLAG_IDLE                 (0xf0000000 | ESMC_SR_IDLE_STATE)   /*!<FIFO is in idle state*/
#define ESMC_FLAG_TXFIFOOV             (0xf0000000 | ESMC_SR_TXFIFOV)      /*!<TX Fifo overflow flag*/
#define ESMC_FLAG_DATAWAIT             (0xf0000000 | ESMC_SR_DATAWAIT)     /*!<ESMC is in wait state*/
#define ESMC_FLAG_SPIF                 (0xf0000000 | ESMC_SR_SPIF)         /*!<Interrupt request flag: There is at least one interrupt request pending*/

#define ESMC_FLAG_CMDIF                (ESMC_IFR1_CMDIF)                   /*!<CMD flag: COMMAND Done*/
#define ESMC_FLAG_RXFIFONEIF           (ESMC_IFR1_RXFIFOEIF )              /*!<FIFO Not Empty flag: FIFO is not Empty*/
#define ESMC_FLAG_RXFIFOHIF            (ESMC_IFR1_RXFIFOHFIF)              /*!<FIFO HALF Full flag: FIFO memory is half filled*/
#define ESMC_FLAG_RXFIFOFIF            (ESMC_IFR1_RXFIFOFIF)               /*!<FIFO Full flag: There is no free space in the FIFO Memory*/
#define ESMC_FLAG_IDLEDONEIF           (ESMC_IFR1_IDLEDONEIF)              /*!<IDLE flag: ESMC completed operation and went to IDLE state*/
#define ESMC_FLAG_DATAWAITIF           (ESMC_IFR1_DATAWAITIF)              /*!<DATA WAIT flag: In write operations FIFO is empty, or In read operations FIFO is full*/
#define ESMC_FLAG_RXFIFOWIF            (ESMC_IFR1_RXFIFOWIF)               /*!<FIFO OVER WORD Flag: Fifo is more than one word*/
#define ESMC_FLAG_ADDRDONEIF           (ESMC_IFR1_ADDRDONEIF)              /*!<ADDRESS Done flag: the Address field has been sent out*/

#define ESMC_FLAG_XIPRDINSTRSETIF      (ESMC_IFR2_XIPRDInstrSetIF << 16)   /*!< XIP Busy in read*/
#define ESMC_FLAG_TXFIFOEIF            (ESMC_IFR2_TXFIFOEIF << 16)         /*!< TX FIFO EMPTY*/
#define ESMC_FLAG_TXFIFOHEIF           (ESMC_IFR2_TXFIFOHEIF << 16)        /*!< TX FIFO HALF EMPTY FLAG*/
#define ESMC_FLAG_TXFIFOFIF            (ESMC_IFR2_TXIFOFIF << 16)          /*!< TX FIFO FULL FLAG*/
#define ESMC_FLAG_TXFIFOOVIF           (ESMC_IFR2_TXFIFOOVIF << 16)        /*!< TX FIFO OVERFLOW FLAG*/
#define ESMC_FLAG_TXWORDOVIF           (ESMC_IFR2_TXWORDOVIF << 16)        /*!< TX not Word Alignt*/
#define ESMC_FLAG_XIPWEINSTRSETIF      (ESMC_IFR2_XIPWEINSTRSETIF << 16)   /*!< XIP Busy in write*/
#define ESMC_FLAG_RXTIMEOUTOF          (ESMC_IFR2_RXTOUTIF << 16)          /*!< RX Timeout*/


#define ESMC_FLAG_XSPI_DUALLATENCY     (ESMC_SR1_XSPI_DUAL_LATENCY)        /*!<Xspi Dual Latency*/
#define ESMC_FLAG_RWDSI_ND             (ESMC_SR1_RWDSI_ND)                 /*!<No RWDSI Clock*/

/**
  * @}
  */

/** @defgroup ESMC_Interrupts EMSC Interrupts
  * @{
  */
#define ESMC_IT_CMD                    (ESMC_IER1_CMDIE)         /*!<Interrupt on the command done*/
#define ESMC_IT_RXFIFONE               (ESMC_IER1_RXFIFONEIE)    /*!<Interrupt on the rx fifo not empty*/
#define ESMC_IT_RXFIFOHF               (ESMC_IER1_RXFIFOHFIE)    /*!<Interrupt on the rx fifo half full flag*/
#define ESMC_IT_RXFIFOF                (ESMC_IER1_RXFIFOFIE)     /*!<Interrupt on the rx fifo full flag*/
#define ESMC_IT_IDLEDONE               (ESMC_IER1_IDLEDONEIE)    /*!<Interrupt on the idle flag*/
#define ESMC_IT_DATAWAIT               (ESMC_IER1_DATAWAITIE)    /*!<Interrupt on the data wait flag*/
#define ESMC_IT_RXFIFOW                (ESMC_IER1_RXFIFOWIE)     /*!<Interrupt on the rx fifo overflow flag*/
#define ESMC_IT_ADDRDONE               (ESMC_IER1_ADDRDONEIE)    /*!<Interrupt on the address done flag*/

#define ESMC_IT_TXFIFOE                (ESMC_IER2_TXFIFOEIE<<16)    /*!<Interrupt on the tx fifo empty flag*/
#define ESMC_IT_TXFIFOHE               (ESMC_IER2_TXFIFOHEIE<<16)   /*!<Interrupt on the tx fifo half empty flag*/
#define ESMC_IT_TXFIFOF                (ESMC_IER2_TXFIFOFIE<<16)    /*!<Interrupt on the tx fifo full flag*/
#define ESMC_IT_TXFIFOOVE              (ESMC_IER2_TXFIFOOVIE<<16)   /*!<Interrupt on the tx fifo overflow flag*/
#define ESMC_IT_TXWORDOVE              (ESMC_IER2_TXWORDOVIE<<16)   /*!<Interrupt on the tx fifo word overflow flag*/

