Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_esmc.h
#define ESMC_IT_ALL                    (ESMC_IT_CMD  | ESMC_IT_RXFIFONE | ESMC_IT_RXFIFOHF | ESMC_IT_RXFIFOF | \
                                        ESMC_IT_IDLEDONE | ESMC_IT_DATAWAIT | ESMC_IT_RXFIFOW | ESMC_IT_ADDRDONE | \
                                        ESMC_IT_TXFIFOE | ESMC_IT_TXFIFOHE | ESMC_IT_TXFIFOF | ESMC_IT_TXFIFOOVE | ESMC_IT_TXWORDOVE)
/**
  * @}
  */

/** @defgroup ESMC_Timeout_definition ESMC Timeout definition
  * @{
  */
#define HAL_ESMC_TIMEOUT_DEFAULT_VALUE ((uint32_t)5000)/* 5 s */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup ESMC_Exported_Macros ESMC Exported Macros
  * @{
  */

/** @brief Reset ESMC handle state
  * @param  __HANDLE__ ESMC handle.
  * @retval None
  */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
#define __HAL_ESMC_RESET_HANDLE_STATE(__HANDLE__)           do {                                              \
                                                                  (__HANDLE__)->State = HAL_ESMC_STATE_RESET; \
                                                                  (__HANDLE__)->MspInitCallback = NULL;       \
                                                                  (__HANDLE__)->MspDeInitCallback = NULL;     \
                                                               } while(0)
#else
#define __HAL_ESMC_RESET_HANDLE_STATE(__HANDLE__)           ((__HANDLE__)->State = HAL_ESMC_STATE_RESET)
#endif

/** @brief  Enable ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE(__HANDLE__)                       SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SPIEN)

/** @brief  Disable ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE(__HANDLE__)                      CLEAR_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SPIEN)

/** @brief  Enable ESMC Global interrupt
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE_GLOBAL_IT(__HANDLE__)             SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_GIE)

/** @brief  Disable ESMC Global interrupt
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE_GLOBAL_IT(__HANDLE__)            CLEAR_BIT((__HANDLE__)->Instance->CR, ESMC_CR_GIE)

/** @brief  Soft reset ESMC
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_SOFT_RESET(__HANDLE__)                   SET_BIT((__HANDLE__)->Instance->CR, ESMC_CR_SOFTRST)

/** @brief  Enables the specified ESMC interrupt.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD        : ESMC Command Done interrupt
  *            @arg ESMC_IT_RXFIFONE   : ESMC FIFO not empty interrupt
  *            @arg ESMC_IT_RXFIFOHF   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_RXFIFOF    : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLEDONE   : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT   : ESMC Datawait interrupt
  *            @arg ESMC_IT_RXFIFOW    : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE   : ESMC Address Done interrupt
  *            @arg ESMC_IT_TXFIFOE    : ESMC TX FIFO empty interrupt
  *            @arg ESMC_IT_TXFIFOHE   : ESMC TX FIFO half empty interrupt
  *            @arg ESMC_IT_TXFIFOF    : ESMC TX FIFO full  interrupt
  *            @arg ESMC_IT_TXFIFOOVE  : ESMC TX FIFO OverFlow interrupt
  *            @arg ESMC_IT_TXWORDOVE  : ESMC TX FIFO unaligned data
  * @retval None
  */
#define __HAL_ESMC_ENABLE_IT(__HANDLE__, __INTERRUPT__)    SET_BIT(*(__IO uint32_t *)(&((__HANDLE__)->Instance->IER1)), (__INTERRUPT__))

/** @brief  Disables the specified ESMC interrupt.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to disable.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD        : ESMC Command Done interrupt
  *            @arg ESMC_IT_RXFIFONE   : ESMC FIFO not empty interrupt
  *            @arg ESMC_IT_RXFIFOHF   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_RXFIFOF    : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLEDONE   : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT   : ESMC Datawait interrupt
  *            @arg ESMC_IT_RXFIFOW    : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE   : ESMC Address Done interrupt
  *            @arg ESMC_IT_TXFIFOE    : ESMC TX FIFO empty interrupt
  *            @arg ESMC_IT_TXFIFOHE   : ESMC TX FIFO half empty interrupt
  *            @arg ESMC_IT_TXFIFOF    : ESMC TX FIFO full  interrupt
  *            @arg ESMC_IT_TXFIFOOVE  : ESMC TX FIFO OverFlow interrupt
  *            @arg ESMC_IT_TXWORDOVE  : ESMC TX FIFO unaligned data
  * @retval None
  */
#define __HAL_ESMC_DISABLE_IT(__HANDLE__, __INTERRUPT__)     CLEAR_BIT(*(__IO uint32_t *)(&((__HANDLE__)->Instance->IER1)), (__INTERRUPT__))

/** @brief  Checks whether the specified ESMC interrupt source is enabled.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __INTERRUPT__ specifies the ESMC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg ESMC_IT_CMD        : ESMC Command Done interrupt
  *            @arg ESMC_IT_RXFIFONE   : ESMC FIFO not empty interrupt
  *            @arg ESMC_IT_RXFIFOHF   : ESMC FIFO half full interrupt
  *            @arg ESMC_IT_RXFIFOF    : ESMC FIFO full interrupt
  *            @arg ESMC_IT_IDLEDONE   : ESMC Idle interrupt
  *            @arg ESMC_IT_DATAWAIT   : ESMC Datawait interrupt
  *            @arg ESMC_IT_RXFIFOW    : ESMC FIFO OverFlow interrupt
  *            @arg ESMC_IT_ADDRDONE   : ESMC Address Done interrupt
  *            @arg ESMC_IT_TXFIFOE    : ESMC TX FIFO Empty interrupt
  *            @arg ESMC_IT_TXFIFOHE   : ESMC TX FIFO Half Empty interrupt
  *            @arg ESMC_IT_TXFIFOF    : ESMC TX FIFO Full interrupt
  *            @arg ESMC_IT_TXFIFOOVE  : ESMC TX FIFO OverFlow interrupt
  *            @arg ESMC_IT_TXWORDOVE  : ESMC TX WORD Over interrupt
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_ESMC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  (READ_BIT(*(__IO uint32_t *)(&((__HANDLE__)->Instance->IER1)), (__INTERRUPT__)) == (__INTERRUPT__))

/**
  * @brief  Get the selected ESMC's flag status.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __FLAG__ specifies the ESMC flag to check.
  *          This parameter can be one of the following values:
  *            @arg ESMC_FLAG_SSACTIVE         : SS output acive flag
  *            @arg ESMC_FLAG_RXBUSY           : RX in progeess flag
  *            @arg ESMC_FLAG_TXBUSY           : TX in progress flag
  *            @arg ESMC_FLAG_XIPBUSY          : ESMC is busy in XIP state
  *            @arg ESMC_FLAG_IDLE             : FIFO is in idle state
  *            @arg ESMC_FLAG_TXFIFOOV         : TX Fifo overflow flag
  *            @arg ESMC_FLAG_DATAWAIT         : ESMC is in wait state
  *            @arg ESMC_FLAG_SPIF             : Interrupt request flag
  *            @arg ESMC_FLAG_CMDIF            : CMD done flag
  *            @arg ESMC_FLAG_RXFIFONEIF       : RX FIFO Not Empty flag
  *            @arg ESMC_FLAG_RXFIFOHIF        : RX FIFO HALF Full flag
  *            @arg ESMC_FLAG_RXFIFOFIF        : RX FIFO Full flag
  *            @arg ESMC_FLAG_IDLEDONEIF       : ESMC is in IDLE state
  *            @arg ESMC_FLAG_DATAWAITIF       : DATA WAIT flag
  *            @arg ESMC_FLAG_RXFIFOWIF        : FIFO OVER WORD Flag
  *            @arg ESMC_FLAG_ADDRDONEIF       : ADDRESS Done flag
  *            @arg ESMC_FLAG_XIPRDINSTRSETIF  : XIP Busy
  *            @arg ESMC_FLAG_TXFIFOEIF        : TX FIFO EMPTY
  *            @arg ESMC_FLAG_TXFIFOHEIF       : TX FIFO HALF EMPTY FLAG
  *            @arg ESMC_FLAG_TXFIFOFIF        : TX FIFO FULL FLAG
  *            @arg ESMC_FLAG_TXFIFOOVIF       : TX FIFO OVERFLOW FLAG
  *            @arg ESMC_FLAG_TXWORDOVIF       : TX not Word Alignt
  *            @arg ESMC_FLAG_XIPWEINSTRSETIF  : XIP Busy in write
  *            @arg ESMC_FLAG_RXTIMEOUTOF      : RX Timeout flag
  * @retval None
  */
#define __HAL_ESMC_GET_FLAG(__HANDLE__, __FLAG__) (((__FLAG__&0xF0000000U) == 0xF0000000U) ? \
                  ((((__HANDLE__)->Instance->SR & (__FLAG__&0x0FFFFFFF)) == ((__FLAG__)&0x0FFFFFFF )) ? SET : RESET) : \
                  ((((*(__IO uint32_t *)(&(__HANDLE__)->Instance->IFR1)) & __FLAG__) == __FLAG__ ) ? SET : RESET))

