Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_esmc.h
/** @brief  Clears the specified ESMC's flag status.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __FLAG__ specifies the ESMC clear register flag that needs to be set
  *          This parameter can be one of the following values:
  *            @arg ESMC_FLAG_CMDIF         : COMMAND Done flag
  *            @arg ESMC_FLAG_ADDRDONEIF    : ADDRESS Done flag
  * @retval None
  */
#define __HAL_ESMC_CLEAR_FLAG(__HANDLE__, __FLAG__)    (__HANDLE__)->Instance->IFR1 = (__FLAG__)

/** @brief  configure which slave select output should be driven during no xip mode.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @param  __SSX__ specifies the CS pin
  *          The parameter can take the following values:
  *            @arg ESMC_SELECT_PIN_CS0
  *            @arg ESMC_SELECT_PIN_CS1
  *            @arg ESMC_SELECT_PIN_CS2
  *            @arg ESMC_SELECT_PIN_CS3
  *            @arg ESMC_SELECT_PIN_CS4
  *            @arg ESMC_SELECT_PIN_CS5
  * @retval None
  */
#define __HAL_ESMC_SET_SSXO(__HANDLE__, __SSX__)             SET_BIT((__HANDLE__)->Instance->ADDR32, (__SSX__)<<ESMC_ADDR32_SSXO_Pos)


/** @brief  Clear TX and RX Fifo
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_CLEAR_FIFO(__HANDLE__)                    SET_BIT((__HANDLE__)->Instance->CR2, ESMC_CR2_TXFIFO_CLR | ESMC_CR2_RXFIFO_CLR)

/** @brief  Enable the slave select.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_ENABLE_SLAVE(__HANDLE__)                  SET_BIT((__HANDLE__)->Instance->ADDR32, ESMC_ADDR32_SS_SET)

/** @brief  Disable the slave select.
  * @param  __HANDLE__ specifies the ESMC Handle.
  * @retval None
  */
#define __HAL_ESMC_DISABLE_SLAVE(__HANDLE__)                 SET_BIT((__HANDLE__)->Instance->ADDR32, ESMC_ADDR32_SS_CLR)

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ESMC_Exported_Functions
  * @{
  */

/** @addtogroup ESMC_Exported_Functions_Group1
  * @{
  */
/* Initialization/de-initialization functions  ********************************/
HAL_StatusTypeDef     HAL_ESMC_Init     (ESMC_HandleTypeDef *hesmc);
HAL_StatusTypeDef     HAL_ESMC_DeInit   (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_MspInit  (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_MspDeInit(ESMC_HandleTypeDef *hesmc);
/**
  * @}
  */

/** @addtogroup ESMC_Exported_Functions_Group2
  * @{
  */
/* IO operation functions *****************************************************/
/* ESMC IRQ handler method */
void                  HAL_ESMC_IRQHandler(ESMC_HandleTypeDef *hesmc);

/* ESMC indirect mode */
HAL_StatusTypeDef     HAL_ESMC_Command      (ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd, uint32_t Timeout);
HAL_StatusTypeDef     HAL_ESMC_Transmit     (ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout);
HAL_StatusTypeDef     HAL_ESMC_TransmitFIFO (ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout);
HAL_StatusTypeDef     HAL_ESMC_Receive      (ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout);
HAL_StatusTypeDef     HAL_ESMC_ReceiveFIFO  (ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout);
HAL_StatusTypeDef     HAL_ESMC_Command_IT   (ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd);
HAL_StatusTypeDef     HAL_ESMC_Transmit_IT  (ESMC_HandleTypeDef *hesmc, uint8_t *pData);
HAL_StatusTypeDef     HAL_ESMC_Receive_IT   (ESMC_HandleTypeDef *hesmc, uint8_t *pData);
HAL_StatusTypeDef     HAL_ESMC_Transmit_DMA (ESMC_HandleTypeDef *hesmc, uint8_t *pData);
HAL_StatusTypeDef     HAL_ESMC_Receive_DMA  (ESMC_HandleTypeDef *hesmc, uint8_t *pData);
HAL_StatusTypeDef     HAL_ESMC_Write_32b    (ESMC_HandleTypeDef *hesmc, uint32_t *pAddress, uint32_t *pSrcBuffer,uint32_t BufferSize);
HAL_StatusTypeDef     HAL_ESMC_Write_16b    (ESMC_HandleTypeDef *hesmc, uint16_t *pAddress, uint16_t *pSrcBuffer,uint32_t BufferSize);
HAL_StatusTypeDef     HAL_ESMC_Write_8b     (ESMC_HandleTypeDef *hesmc, uint8_t *pAddress,  uint8_t *pSrcBuffer ,uint32_t BufferSize);
/* QSPI memory-mapped mode */
HAL_StatusTypeDef HAL_ESMC_MemoryMapped(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd);
HAL_StatusTypeDef HAL_ESMC_MemoryWrite(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd);

/* Callback functions in non-blocking modes ***********************************/
void                  HAL_ESMC_ErrorCallback        (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_AbortCpltCallback    (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_SetSSxO(ESMC_HandleTypeDef *hesmc, uint32_t SSxO);

/* ESMC indirect mode */
void                  HAL_ESMC_CmdCpltCallback      (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_RxCpltCallback       (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_TxCpltCallback       (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_RxHalfBlockCpltCallback   (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_TxHalfBlockCpltCallback   (ESMC_HandleTypeDef *hesmc);

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
/* ESMC callback registering/unregistering */
HAL_StatusTypeDef     HAL_ESMC_RegisterCallback     (ESMC_HandleTypeDef *hesmc, HAL_ESMC_CallbackIDTypeDef CallbackId, pESMC_CallbackTypeDef pCallback);
HAL_StatusTypeDef     HAL_ESMC_UnRegisterCallback   (ESMC_HandleTypeDef *hesmc, HAL_ESMC_CallbackIDTypeDef CallbackId);
#endif
/**
  * @}
  */

/** @addtogroup ESMC_Exported_Functions_Group3
  * @{
  */
/* Peripheral Control and State functions  ************************************/
HAL_ESMC_StateTypeDef HAL_ESMC_GetState        (ESMC_HandleTypeDef *hesmc);
uint32_t              HAL_ESMC_GetError        (ESMC_HandleTypeDef *hesmc);
HAL_StatusTypeDef     HAL_ESMC_Abort           (ESMC_HandleTypeDef *hesmc);
HAL_StatusTypeDef     HAL_ESMC_Abort_IT        (ESMC_HandleTypeDef *hesmc);
void                  HAL_ESMC_SetTimeout      (ESMC_HandleTypeDef *hesmc, uint32_t Timeout);
/**
  * @}
  */

/**
  * @}
  */

