Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_esmc.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup ESMC_Private_Macros ESMC Private Macros
  * @{
  */

#define IS_ESMC_CLOCK_PRESCALER(PRESCALER)  ((PRESCALER) <= 0xFF && (PRESCALER) >= 0x2)


#define IS_ESMC_CLOCK_MODE(CLKMODE)         (((CLKMODE) == ESMC_CLOCK_MODE_0) || \
                                             ((CLKMODE) == ESMC_CLOCK_MODE_3))


#define IS_ESMC_DUAL_FLASH_MODE(MODE)    (((MODE) == ESMC_DUALFLASH_ENABLE) || \
                                          ((MODE) == ESMC_DUALFLASH_DISABLE))

#define IS_ESMC_CS_HIGH_TIME(TIME)          (((TIME) == ESMC_CS_HIGH_TIME_1_CYCLE) || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_2_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_3_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_4_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_5_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_6_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_7_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_8_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_9_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_10_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_11_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_12_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_13_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_14_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HIGH_TIME_15_CYCLE))


#define IS_ESMC_CS_HOLD_TIME(TIME)          (((TIME) == ESMC_CS_HOLD_TIME_2_CYCLE) || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_3_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_4_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_5_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_6_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_7_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_8_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_9_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_10_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_11_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_12_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_13_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_14_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_15_CYCLE)  || \
                                             ((TIME) == ESMC_CS_HOLD_TIME_16_CYCLE))


#define IS_ESMC_INSTRUCTION(INSTRUCTION)    ((INSTRUCTION) <= 0xFFFF)

#define IS_ESMC_INSTRUCTION_LENGTH(LENGTH)   (((LENGTH) == ESMC_INSTRCUTION_LEN_1_BYTE)|| \
                                             ((LENGTH) == ESMC_INSTRCUTION_LEN_2_BYTE))

#define IS_ESMC_ADDRESS_SIZE(ADDR_SIZE)     (((ADDR_SIZE) == ESMC_ADDRESS_8_BITS)  || \
                                             ((ADDR_SIZE) == ESMC_ADDRESS_16_BITS) || \
                                             ((ADDR_SIZE) == ESMC_ADDRESS_24_BITS) || \
                                             ((ADDR_SIZE) == ESMC_ADDRESS_32_BITS))

#define IS_ESMC_DUMMY_CYCLES(DCY)           ((DCY) <= 63)

#define IS_ESMC_INSTRUCTION_MODE(MODE)      (((MODE) == ESMC_INSTRUCTION_NONE)         || \
                                             ((MODE) == ESMC_INSTRUCTION_SINGLE_LINE)  || \
                                             ((MODE) == ESMC_INSTRUCTION_MULTI_LINES))

#define IS_ESMC_ADDRESS_MODE(MODE)          (((MODE) == ESMC_ADDRESS_NONE)         || \
                                             ((MODE) == ESMC_ADDRESS_SINGLE_LINE)  || \
                                             ((MODE) == ESMC_ADDRESS_MULTI_LINES))

#define IS_ESMC_ALTERNATE_BYTES_MODE(MODE)  (((MODE) == ESMC_ALTERNATE_BYTES_DISABLE) || \
                                             ((MODE) == ESMC_ALTERNATE_BYTES_ENABLE))

#define IS_ESMC_ALTERNATE_BYTE(ALT)         ((ALT) <= 0xFF)

#define IS_ESMC_DATA_MODE(MODE)             (((MODE) == ESMC_DATA_NONE)    || \
                                             ((MODE) == ESMC_DATA_WRITE)   || \
                                             ((MODE) == ESMC_DATA_READ))

#define IS_ESMC_DDR_MODE(DDR_MODE)          (((DDR_MODE) == ESMC_DDR_DISABLE)    || \
                                             ((DDR_MODE) == ESMC_DDR_DATA)       || \
                                             ((DDR_MODE) == ESMC_DDR_ADDR_DATA)  || \
                                             ((DDR_MODE) == ESMC_DDR_CMD_ADDR_DATA))

#define IS_ESMC_DQS_MODE(MODE)              (((MODE) == ESMC_DQS_ENABLE) || \
                                             ((MODE) == ESMC_DQS_DISABLE))

#define IS_ESMC_SAMPLESHIFTING(SAMPLESHIFTING)    ((SAMPLESHIFTING) <= ESMC_SAMPLE_SHIFTING_63_CYCLE)

#define IS_ESMC_XSPI_DUALLATENCY(DUALLATENCY)    (((DUALLATENCY) == ESMC_XSPI_DUALLATENCY_ENABLE) || \
                                                  ((DUALLATENCY) == ESMC_XSPI_DUALLATENCY_DISABLE))
/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup ESMC_Private_Functions ESMC Private Functions
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_HAL_ESMC_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
